package HomeWork09;

/**
 * Ответственный за создание класса - А.А. Дюжаков
 * Дата создания: 21.10.2021
 *
 * 1. Написать функцию, принимающую список Student и возвращающую список уникальных курсов, на которые подписаны студенты.
 *
 * 2. Написать функцию, принимающую на вход список Student и возвращающую список из трех самых любознательных
 * (любознательность определяется количеством курсов).
 *
 * 3. Написать функцию, принимающую на вход список Student и экземпляр Course, возвращающую список студентов, которые посещают этот курс.
 */

public class HomeApp09 {
}
